// import 'package:get/get.dart';

// class localizations extends Translations {
//   @override
//   // TODO: implement keys
//   Map<String, Map<String, String>> get keys => {
//         "ar": {
//           "1": "اختر اللغة",
//           "2": "العربية",
//           "3": "الأنجليزية",
//           /////////////////////  ON BOARDING //////////////
//           "4": "احجز بادل بكل سهولة مع صحابك",
//           "5":
//               "متشيلش هم مين يروح يحجز الملعب تاني واحجز بكل سهولة من علي تطبيق بادل",
//           "6": "ابحث عن الملعب المناسب ليك",
//           "7":
//               "  دلوقتي تقدر تختار الملعب الاقرب والاحسن ليك في السعر والمسافة من ملاعب كتير حواليك",
//           "8": "اختار طريقة الدفع المناسبة ليك",
//           "9":
//               "دلوقتي تقدر تدفع بفيزا او بالمحفظة او فودافون كاش بكل امان وسهولة",
//           "10": "تمام",
//           ////////////////////////////  /  AUTH  SIGN IN  /////////////////////////////////////////////////////
//           "11": "تسجيل الدخول",
//           "12": "سجل الدخول واستمتع بالعديد من العروض",
//           "13": "الأيميل",
//           "14": "كلمة المرور",
//           "15": "هل نسيت كلمة المرور ؟",
//           "16": "تسجيل الدخول",
//           "17": "ليس لديك حساب ؟",
//           "18": "إنشاء حساب جديد",
//           ////////////////////////////  /  AUTH   SIGN UP   /////////////////////////////////////////////////////
//           "19": "إنشاء حساب",
//           "20": "قم بإنشاء حساب جديد ",
//           "21": "الأسم",
//           "22": "الأيميل",
//           "23": "رقم الهاتف",
//           "24": "كلمة المرور",
//           "25": "تسجيل الدخول",
//           "69": "او سجل الدخول بجوجل",
//           "26": "بالغعل لديك حساب ؟  ",
//           "27": "إنشاء حساب",
//           ////////////////////////////  /  AUTH  RESRTPASSWORD   /////////////////////////////////////////////////////
//           "28": "إعادة تعيين كلمة المرور",
//           "29": "أدخل الحساب",
//           "30": "أدخل الحساب لأعادة تعيين كلمة المرور",
//           "31": "إرسال",
//           "32": "الأيميل",
//           ////////////////////////////  /  AUTH  Vertfication   /////////////////////////////////////////////////////
//           "33": "رمز التحقيق",
//           "34": "التحقق من الرمز",
//           "35": "من فضلك أدخل رمز التحقق التي تم إرسالة علي الهاتف",
//           ////////////////////////////  /  AUTH  RESETPASSWORD   /////////////////////////////////////////////////////
//           "36": "إِعادة تعيين كلمة المرور",
//           "37": "من فضلك أدخل كلمو المرور الجديدة",
//           "38": "كلمة المرور",
//           "39": "تأكيد كلمة المرور",
//           "40": "تأكيد",
//           //////////////////////////////////////////resetpasswordcontroller///////////////////////////////////
//           "41": "خطأ",
//           "42": "كلمة المرور غير متطابقة",
//           "43": "خطأ ما",
//           "44": "كلمة المرور سبق استخدامها",
//           //////////////////////////////////////////SuccessResetPassword///////////////////////////////////
//           "45": "اعادة تعيين كلمة مرور ناجحة",
//           "46": "تم تغيير كلمة المرور بنجاح",
//           "47": "من فضلك استخدم كلمة المرور الجديدة لتسجيل الدخول",
//           "48": "تسجيل الدخول",
//           //////////////////////////////////////////SuccessSIGNUP///////////////////////////////////
//           "49": "انشاء حساب ناجح",
//           "50": "تم انشاء الحساب بنجاح",
//           "51": "من فضلك استخدم الحساب الجديد في عملية تسجيل الدخول",
//           "52": "تسجيل الدخول",
//           //////////////////////////////////////////SIGNIN CONTROLLER///////////////////////////////////
//           "53": "خطأ",
//           "54": "الحساب أو كلمة المرور خاطئة",
//           //////////////////////////////////////////SIGNUP CONTROLLER///////////////////////////////////
//           "55": "خطأ",
//           "56": "الحساب أو كلمة المرور موجود بالغعل",
//           //////////////////////////////////////////Vertication CONTROLLER///////////////////////////////////
//           "57": "خطأ",
//           "58": "رمز التحقق غير صحيح",
//           //////////////////////////////////////////Choose Country///////////////////////////////////
//           "59": "أختر المحافظة",
//           "79": "أختر المحافظة",

//           //////////////////////////////////////////HOME///////////////////////////////////
//           "60": "اهلا يا ",
//           "61": "أختار الملعب المناسب ليك بسهولة",
//           "62": "الملاعب الكثر تقييما",
//           "63": "العروض",
//           "64": "كل الملاعب",
//           "65": "ابحث عن ملاعب البادل",
//           //////////////////////////////////////////SETTINGS///////////////////////////////////
//           "66": "الضبط",
//           "67": "الكاميرا",
//           "68": "المعرض",
//           "69": "أو",
//           "70": "",
//           "71": "",
//           "72": "",
//           "73": "",
//           "74": "",
//           "75": "",
//           "76": "",
//           "77": "",
//           "78": "",
//         },
//         "en": {
//           "1": "Choose The Language",
//           "2": "Arabic",
//           "3": "English",
//           /////////////////////  ON BOARDING ///////////
//           "4": "Book Padel Game Very Easily",
//           "5": "Book Very Easily Now From Your Home Across Padel Application",
//           "6": "Search For Suitable Padel Playground From Many Playgrounds",
//           "7":
//               "Now You Can Saerch For The Nearest Playground From Many Playgrounds Around You ",
//           "8": "Choose The Payment Method",
//           "9":
//               "Now You Can Pay Easily From Multible Payment Method visa , E-Wallet And Vodafon Cash ",
//           "10": "Done",
//           ////////////////////////////  /  AUTH   SIGN IN   /////////////////////////////////////////////////////
//           "11": "Welcome Back",
//           "12": "Sign in to continue",
//           "13": "Email",
//           "14": "Paswword",
//           "15": "Forget Password ?",
//           "16": "LOGIN",
//           "17": "Don't have account  ? ",
//           "18": "Create a new account",
//           //////////////////////////////////////////SETTINGS///////////////////////////////////

//           ////////////////////////////  /  AUTH   SIGN UP  /////////////////////////////////////////////////////

//           "19": "Create Account",
//           "20": "Craete a new account",
//           "21": "Name",
//           "22": "Email",
//           "23": "Phone",
//           "24": "Password",
//           "25": "Login",
//           "69": "Or login with",
//           "26": "Already have account ?  ",
//           "27": "SignUp",
//           ////////////////////////////  /  AUTH  RESRTPASSWORDEMAIL   /////////////////////////////////////////////////////
//           "28": "Forget Password",
//           "29": "Enter E-mail Addrees",
//           "30": "Please Enter Your Email Address To send You Vertfication code",
//           "31": "Send",
//           "32": "Email",
//           ////////////////////////////  /  AUTH  Vertfication   /////////////////////////////////////////////////////
//           "33": "Vertfication Code",
//           "34": "Check Code",
//           "35": "Please Enter The Verfication Code That Sent On Your Email",
//           ////////////////////////////  /  AUTH  RESETPASSWORD   /////////////////////////////////////////////////////
//           "36": "Reset Password",
//           "37": "Enter Your New Password",
//           "38": "Password",
//           "39": "Confirm Password",
//           "40": "Confirm",
//           //////////////////////////////////////////resetpasswordcontroller///////////////////////////////////
//           "41": "Error",
//           "42": "Password Aren't Match",
//           "43": "Warning",
//           "44": "Password is used before",
//           //////////////////////////////////////////SuccessResetPassword///////////////////////////////////
//           "45": "Success Reset Password",
//           "46": "Your Password has been changed",
//           "47": "Please Use Your New Password To Comlete Login Process",
//           "48": "Login",
//           //////////////////////////////////////////SuccessSIGNUP///////////////////////////////////
//           "49": "Success SignUP",
//           "50": "Your Email has been Created",
//           "51": "Please Use Your New Email To Comlete Login Process",
//           "52": "Login",
//           //////////////////////////////////////////SIGNIN CONTROLLER///////////////////////////////////
//           "53": "Error",
//           "54": "Email or Password wrong",
//           //////////////////////////////////////////SIGNUP CONTROLLER///////////////////////////////////
//           "55": "Error",
//           "56": "Email or Password already exsist",

//           //////////////////////////////////////////Vertficatio CONTROLLER///////////////////////////////////
//           "57": "Error",
//           "58": "Wrong Vertfication Code",
//           //////////////////////////////////////////Choose Country///////////////////////////////////
//           "59": "Choose governorate",
//           "79": "Choose governorate",

//           //////////////////////////////////////////HOME///////////////////////////////////
//           "60": "Hi,",
//           "61": "Let us help you to find suitable padel place",
//           "62": "Top Rated Padel",
//           "63": "Offers",
//           "64": "View all",
//           "65": "Search for padel place",
//           //////////////////////////////////////////SETTINGS///////////////////////////////////
//           "66": "Setting",
//           "67": "camera",
//           "68": "gallery",
//           "69": "OR",
//           "70": "",
//           "71": "",
//           "72": "",
//           "73": "",
//           "74": "",
//           "75": "",
//           "76": "",
//           "77": "",
//           "78": "",
//         }
//       };
// }