import 'package:get/get_navigation/src/root/internacionalization.dart';

class localizations extends Translations {
  @override
  Map<String, Map<String, String>> get keys => {
        "ar": {
          "1": "اختار لغتك",
          "2": "عربي",
          "3": "إنجليزي",
          /////////////////////  ON BOARDING //////////////

          ////////////////////////////  /  AUTH  SIGN IN  /////////////////////////////////////////////////////
          "11": "سجل دخولك",
          "12": "سجل دخولك عشان تكمل رحلتك",
          "557": "مرحبا بيك تاني",
          "13": "البريد الإلكتروني",
          "14": "كلمة السر",
          "15": "نسيت كلمة السر؟",
          "16": "دخول",
          "17": "ماعندكش حساب؟",
          "18": "اعمل حساب جديد",
          ////////////////////////////  /  AUTH  SIGN UP   /////////////////////////////////////////////////////
          "19": "اعمل حساب جديد",
          "555": "انضم إلى مجتمعنا الداعم",
          "20": "أنشئ حساب بسهولة",
          "21": "الاسم",
          "22": "البريد الإلكتروني",
          "23": "رقم الموبايل",
          "24": "كلمة السر",
          "556": "تأكيد كلمة السر ",

          "25": "تسجيل دخول",
          "69": "أو سجل بجوجل",
          "26": "عندك حساب؟",
          "27": "تسجيل حساب",
          "200": "التالي",
          ////////////////////////////  /  AUTH  RESET PASSWORD  /////////////////////////////////////////////////////
          "28": "إعادة تعيين كلمة السر",
          "29": "اكتب بريدك الإلكتروني",
          "30": "اكتب بريدك عشان نبعتلك كود التحقق",
          "31": "إرسال",
          "32": "البريد الإلكتروني",
          "201": "تفعيل الكود",
          ////////////////////////////  /  AUTH  VERIFICATION  /////////////////////////////////////////////////////
          "33": "كود التحقق",
          "34": "تحقق من الكود",
          "35": "اكتب الكود اللي بعتناه على موبايلك",
          "36": "تغيير كلمة السر ",
          "37": "اكتب كلمة السر الجديدة",
          "40": "تمام",
          "41": "خطأ",
          "42": "كلمة المرور غير متطابقة",
          "43": "خطأ ما",
          "44": "كلمة المرور سبق استخدامها",

          ///////////////////////SuccesResetPassword////////////////////////
          "45": "نجاح تغيير كلمة المرور",
          "46": "تم تغيير كلمة المرور الخاصة بك",
          "47": "يرجى استخدام كلمة المرور الجديدة لإكمال عملية تسجيل الدخول",
          "48": "تسجيل الدخول",
          ////////////////////////////////////////SuccessSIGNUP///////////////////////////////////
          "49": "انشاء حساب ناجح",
          "50": "تم انشاء الحساب بنجاح",
          "51": "من فضلك استخدم الحساب الجديد في عملية تسجيل الدخول",
          "52": "تسجيل الدخول",
          //////////////////////////////////////////SIGNIN CONTROLLER///////////////////////////////////
          "53": "خطأ",
          "54": "الحساب أو كلمة المرور خاطئة",
          //////////////////////////////////////////SIGNUP CONTROLLER///////////////////////////////////
          "55": "خطأ",
          "56": "الحساب أو كلمة المرور موجود بالغعل",
          ///////////////////////////////////////////

          "57": "خطأ",
          "58": "كود غير صالح",

          //////////////////////////////////////////HOME///////////////////////////////////
          "60": "أهلاً بيك",
          "61": "خلينا نساعدك تلاقي الملعب المناسب",
          "62": "الملاعب القريبة",
          "63": "العروض",
          "64": "شوف الكل",
          "65": "دور على ملعب بادل",
          "72": "مفيش نتائج",
          "73": "مفيش نتائج لكلمة البحث اللي كتبتها",
          "74": "(0 تقييمات)",
          "76": "جنيه/ساعة",
          //////////////////////////////////////////SETTINGS///////////////////////////////////
          "66": "الإعدادات",
          "67": "الكاميرا",
          "68": "المعرض",

          /////////////////////////////SETTINGS////////////////////////////
          "85": "اختار إعداداتك المخصصة",
          "86": "الحساب",
          "87": "الإعدادات",
          "88": "اللغة",
          "89": "الموقع",
          "90": "الأمان",
          "91": "الوضع الداكن",
          "92": "الإشعارات",
          "93": "عننا",
          "94": "سياسة الخصوصية",
          "95": "الشروط والأحكام",
          "96": "حذف الحساب",
          "97": "تسجيل الخروج",
          "98": "متأكد إنك عايز تعمل تسجيل خروج؟",
          "99": "استمرار",
          "100": "إلغاء",
          "101": "حذف الحساب",
          "102": "المزيد",
          "103": "تفاصيل الحساب",
          "104": "اطفالي",
          "105": "الاسم",
          "106": "خطأ",
          "107": "من فضلك ادخل اسم مستخدم صحيح",
          "108": "تم تغيير اسم المستخدم بنجاح",
          "109": "اسم المستخدم",
          "110": "اكتب كلمة السر",
          "111": "متأكد إنك عايز تحذف حسابك؟",
          "112": "استمرار",
          "113": "إلغاء",
          "114": "حذف الحساب",
          "205": "المفضلة",

          ////////////////////HandelingErrors/////////////////////////

          "124": "الإيميل ده مستخدم قبل كده",
          "125": "التليفون ده مستخدم قبل كده",
          "126": "البيانات دي مطلوبة",
          "127": "اكتب اسم مستخدم صحيح",
          "128": "اسم المستخدم قصير جدًا",
          "129": "اسم المستخدم طويل جدًا",
          "130": "اكتب إيميل صحيح",
          "140": "الإيميل قصير جدًا",
          "141": "الإيميل طويل جدًا",
          "300": "اكتب رقم موبايل صحيح",
          "301": "رقم الموبايل غير صحيح",
          "302": "رقم الموبايل غير صحيح",
          "303": "الباسورد ضعيف جدًا",
          "304": "الباسوردات مش متطابقة",
          "305": "مينفعش الايميل يكون فيه حروف كابيتال",
          "306": "في خطأ حصل",
          "307": "في مشكلة في السيرفر",
          "308": "مفيش اتصال، تأكد من النت وجرب تاني",

          "309": "الرقم ده مستخدم قبل كده",
          "310": "الإيميل ده مستخدم قبل كده",
          "311": "خطأ",
          "312": "المستخدم مش موجود",
          "313": "",
          "314": "",

          "337": "هل أنت متأكد إنك عايز تحذف حسابك؟",
          "338": "استمرار",
          "339": "إلغاء",
          "340": "كلمة المرور مطلوبة للحذف",

          ///////////////////////////////

          "368": "الرئيسية",
          "369": "الأنشطة",
          "370": "الأعدات",

          "371": "رفع الفيديو",
          "372": "تحليل أنماط السلوك",
          "373": "مرحبا بيك في أوتيفا",

          "374": "الألعاب",
          "375": "الفيديوهات التعليمية",
          "376": "التواصل",
          "377": "الألعاب للتعلم والتطوير",
          "378": "محتوى فيديو مختار ل\nفهم التوحد",
          "379": "الدردشة مع مساعدنا الذكي\nللحصول على الدعم",
          "380": "استكشف موارد التعلم والدعم",

          ////////////////////HandelingErrors/////////////////////////

          /////////////////Settttttinnngsss///////////////////
        },
        "en": {
          "1": "Pick Your Language",
          "2": "Arabic",
          "3": "English",

          ////////////////////////////  /  AUTH   SIGN IN   /////////////////////////////////////////////////////
          "11": "Login",
          "12": "Sign in to continue your journey",
          "557": "Welcome Back",
          "13": "Email",
          "14": "Password",
          "15": "Forgot your password?",
          "16": "Sign in",
          "17": "Don't have an account?",
          "18": "Sign up",
          ////////////////////////////  /  AUTH   SIGN UP  /////////////////////////////////////////////////////
          "19": "Sign up",
          "20": "Create a new account",
          "555": "Join our supportive community",
          "556": "Confirm Password",
          "21": "Name",
          "22": "Email",
          "23": "Phone",
          "24": "Password",
          "25": "Log in",
          "69": "Or Continue with",
          "26": "Already have an account?",
          "27": "Sign up",

          ///////////////////////////////////////SuccessSignIn///////////////////////////
          "49": "Success SignUP",
          "50": "Account created Successfully",
          "51": "Use your new email and password to login",
          "52": "Login",
          ////////////////////////////  /  AUTH  RESET PASSWORD  /////////////////////////////////////////////////////
          "28": "Forgot password",
          "29": "Enter your email",
          "30": "Enter your email to get a verification code",
          "31": "Send",
          "32": "Email",
          "201": "Vertify",

          "36": "Reset Password",
          "37": "Write Your new password",
          "40": "Done",
          ////////////////////////////////////////SuccessResetPassword///////////////////////////////////
          "45": "Success Reset Password",
          "46": "Your Password has been changed",
          "47": "Please Use Your New Password To Comlete Login Process",
          "48": "Login",

          //////////////////////////////////////////SIGNIN CONTROLLER///////////////////////////////////
          "53": "Error",
          "54": "Email or Password wrong",
          //////////////////////////////////////////SIGNUP CONTROLLER///////////////////////////////////
          "55": "Error",
          "56": "Email or Password already exsist",
          //////////////////////////  /  AUTH  VERIFICATION  /////////////////////////////////////////////////////
          "33": "Verification Code",
          "34": "Check the code",
          "35": "Enter the code we sent to your phone",

          //////////////////////////////////////////SETTINGS///////////////////////////////////
          "66": "Settings",
          "67": "Camera",
          "68": "Gallery",
          //////////////////////////////////////ChooseCountry////////////////////////////
          "85": "choose your custome settings",
          "86": "Account",
          "87": "Settings",
          "88": "Language",
          "89": "Location",
          "90": "Security",
          "91": "Dark Mode",
          "92": "Notifications",
          "93": "About Us",
          "94": "Privacy Policy",
          "95": "Terms and Conditions",
          "96": "Delete Account",
          "97": "Logout",
          "98": "Are you sure you want to logout?",
          "99": "Continue",
          "100": "Cancel",
          "101": "Delete Account",
          "102": "More",
          "103": "Account Details",
          "104": "my children",
          "105": "Name",
          "106": "Error",
          "107": "Please enter a valid username",
          "108": "Username changed successfully",
          "109": "Username",
          // "110": " ",
          // "111": "متأكد إنك عايز تحذف حسابك؟",
          // "112": "استمرار",
          // "113": "إلغاء",
          // "114": "حذف الحساب",
          // "205": "المفضلة",
          ////////////////////HandelingErrors/////////////////////////

          "124": "The email has already been taken.",
          "125": "The phone has already been taken.",
          "126": "Requid Filled",
          "127": "Please Enter Valid username",
          "128": "username is too short",
          "129": "username is too long",
          "130": "Please Enter Valid Email",
          "140": "Email is too short",
          "141": "Email is too long",
          "300": "Please Enter Valid Phone Number",
          "301": "Not Valid Phone Number",
          "302": "Not Valid Phone Number",
          "303": "Password is Weak",
          "304": "Passwords aren't match",
          "305": "Email shouldn't contain capital letters",
          "306": "An error occurred",
          "307": "Server issue encountered",
          "308": "No connection. Please check your internet and try again",

          "309": "This phone number is already in use.",
          "310": "This email address is already in use.",

          "311": "error",
          "312": "User not found",
          "313": "",
          "314": "",

          "340": "Password is required for deletion",

          ///////////////////////////////////////////////////////////
          "368": "Home",
          "369": "Activities",
          "370": "Settings",
          ////////////////////////
          ///
          "371": "upload video",
          "372": "analyze behavior patterns",
          "373": "Welcome to Autiva",
          ////////////////////acticities//////////
          "374": "Games",
          "375": "Educational Videos",
          "376": "Communication",
          "377": "Interactive games for\nlearning and development",
          "378": "Curated video content for\nunderstanding autism",
          "379": "Chat with our AI assistant\nfor support",
          "380": "Explore learning and support resources",
        }
      };
}
